In [1]:
print"hello"

SyntaxError: invalid syntax (3323248031.py, line 1)

In [2]:
print("hello")

hello

In [2]:
import pandas as pd
s1=pd.Series([1,2,3],["usa","india","japan"])
s2=pd.Series([1,2,3],["usa","spain","ussr"])

1+1

In [3]:
s1+s2

india    NaN
japan    NaN
spain    NaN
usa      2.0
ussr     NaN
dtype: float64

In [5]:
1/2

0.5

In [9]:
1+55

56

In [11]:
n='jay'
num=25

In [14]:
print("my name is{one}and age is{two}".format(one=n,two=num
                                       ))

my name isjayand age is25

In [28]:
import numpy as np
from numpy.random import randn
np.random.seed(101)
df=pd.DataFrame(randn(5,4),["a","b","c","d","j"],["z","x","cc","aa"])

In [37]:
df=pd.DataFrame(randn(4,3),["a","b","c","d"],["x","y","z"])
df

          x         y         z
a -0.497104 -0.754070 -0.943406
b  0.484752 -0.116773  1.901755
c  0.238127  1.996652 -0.993263
d  0.196800 -1.136645  0.000366

In [35]:
df["z"]["d"]

0.18869530944922425

In [18]:
l

[1, 2, 3, 'b']

In [1]:
d={"k1":123,"k2":55}

In [2]:
d["k1"]

123

In [3]:
d[123]

KeyError: 123

In [6]:
d={"k1":{"g1":"go","k11":[1,2,3,[22,33]]}}

In [7]:
d

{'k1': {'g1': 'go', 'k11': [1, 2, 3, [22, 33]]}}

In [10]:
d["k1"]["k11"][3][1]

33

In [11]:
d.keys()

dict_keys(['k1'])

In [12]:
d["k1"].keys([1,2,3,[22,22]])

TypeError: dict.keys() takes no arguments (1 given)

In [22]:

name=input("enter the name")

enter the namekk

In [14]:
d[name]=input("enter the number")

enter the number97451068267

In [15]:
d

{'jay': '97451068267'}

In [16]:
list('name')

['n', 'a', 'm', 'e']

In [26]:
i=0
for i in (list("name")):
    print(i)

n
a
m
e

In [43]:
def myfun(p="gi"):
    print(p)

In [44]:
myfun()

gi

In [39]:
d={}
i=int(input("enter the limit"))
for i in range(i):  
    name=input("enter your name")
    d[name]=input("enter phn number")

enter the limit5
enter your namejay
enter phn number99
enter your namel5
enter phn number55
enter your namess
enter phn number6
enter your namedsd
enter phn number63
enter your namesadada
enter phn number3

In [40]:
print(d)

{'jay': '99', 'l5': '55', 'ss': '6', 'dsd': '63', 'sadada': '3'}

In [41]:
del d["jay"]

In [42]:
d

{'l5': '55', 'ss': '6', 'dsd': '63', 'sadada': '3'}

In [52]:
def sqet(s):
    """" hello hello hello"""
    r=s**2
    return r*2;

In [53]:
sqet(10)

200

In [51]:
sqet

In [54]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [79]:
import numpy as np
def sum(p):
    a=int(input("enter the 1st"))
    b=int(input("enter 2"))
    s=a+b+p
    return s;

In [80]:
sum(5)

enter the 1st5
enter 25

15

In [81]:
def time(q):
    return q+2;

In [84]:
w=list(range(10))

In [85]:
w

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [86]:
list(map(time,w))

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [91]:
s=lambda a,b:a+b

In [92]:
s(1,5)

6

In [93]:
pip install numpy

Requirement already satisfied: numpy in c:\users\jayesh raj\appdata\local\programs\python\python39\lib\site-packages (1.21.2)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.3; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\JAYESH RAJ\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [3]:
import numpy as np
np.random.randint(5,10,4)

array([6, 8, 8, 7])

In [5]:
a=np.random.randint(0,10,5)
a

array([5, 8, 8, 4, 6])

In [7]:
a.max()

8

In [8]:
a.min()

4

In [9]:
a.argmax()

1

In [10]:
a.argmin()

3

In [17]:
a=np.append(a,10)

In [26]:
a=a.reshape(2,3)

In [27]:
a.shape

(2, 3)

In [28]:
a

array([[ 5,  8,  8],
       [ 4,  6, 10]])

In [31]:
a=np.arange(25).reshape(5,5)

In [32]:
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [57]:
b=a[2:,2:].copy()

In [118]:
np.eye(55)

array([[1., 0., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 1.]])

In [38]:
df=pd.DataFrame(randn(3,3),["a","b","c"],["d","e","f"])

In [42]:
df

          d         e         f
a  1.025984 -0.156598 -0.031579
b  0.649826  2.154846 -0.610259
c -0.755325 -0.346419  0.147027

In [46]:
df.loc["a","d"]=1

In [61]:
df.iloc[[1]]=[1,2,3]

In [69]:
df

          d         e         f
a  1.000000 -0.156598 -0.031579
b  1.000000  2.000000  3.000000
c -0.755325 -0.346419  0.147027

In [81]:
df.loc[["a","b"]]

     d         e         f
a  1.0 -0.156598 -0.031579
b  1.0  2.000000  3.000000

In [83]:
df["new"]=df["e"]+df["f"]

In [91]:
df.drop(["new"],axis=1,inplace=True)

In [92]:
df

          d         e         f
a  1.000000 -0.156598 -0.031579
b  1.000000  2.000000  3.000000
c -0.755325 -0.346419  0.147027

In [101]:
df.loc[["a","b"],["e","f"]]=[11,22],[121,23]

In [102]:
df

          d           e          f
a  1.000000   11.000000  22.000000
b  1.000000  121.000000  23.000000
c -0.755325   -0.346419   0.147027

In [103]:
df.index()

TypeError: 'Index' object is not callable

In [104]:
df

          d           e          f
a  1.000000   11.000000  22.000000
b  1.000000  121.000000  23.000000
c -0.755325   -0.346419   0.147027

In [105]:
df.reset_index()

  index         d           e          f
0     a  1.000000   11.000000  22.000000
1     b  1.000000  121.000000  23.000000
2     c -0.755325   -0.346419   0.147027

In [110]:
df.loc[["a","b"],["e","f"]]=[0,0],[1,1]

In [111]:
df

          d         e         f
a  1.000000  0.000000  0.000000
b  1.000000  1.000000  1.000000
c -0.755325 -0.346419  0.147027

In [114]:
df.set_index("f",inplace=True)

In [26]:
import numpy as np

In [27]:
import pandas as pd
import numpy as np
from numpy.random import randn
#np.random.seed(101)
df=pd.DataFrame(randn(3,3),["a","b","c"],["q","w","e"])

In [28]:
df

          q         w         e
a  2.605967  0.683509  0.302665
b  1.693723 -1.706086 -1.159119
c -0.134841  0.390528  0.166905

In [33]:
df["q"]["a"]

2.60596727979128

In [39]:
df.loc[["a","b"],["q","w"]]=["0","0"],["0","2"]

In [40]:
df

          q         w         e
a         0         0  0.302665
b         0         2 -1.159119
c -0.134841  0.390528  0.166905

In [47]:
d={"a":list("ksksk"),"b":list("idood")}

In [48]:
d

{'a': ['k', 's', 'k', 's', 'k'], 'b': ['i', 'd', 'o', 'o', 'd']}

In [51]:
df=pd.DataFrame(d)

In [54]:
df.dropk()

AttributeError: 'DataFrame' object has no attribute 'dropk'

In [55]:
groupby

In [56]:
d={"comp":["google","mcf","mcf","google","fb"],"name":["jay","abhi","don","dave","john"],"sales":["200","100","12","11","55"]}

In [57]:
d

{'comp': ['google', 'mcf', 'mcf', 'google', 'fb'],
 'name': ['jay', 'abhi', 'don', 'dave', 'john'],
 'sales': ['200', '100', '12', '11', '55']}

In [58]:
d["name"]

['jay', 'abhi', 'don', 'dave', 'john']

In [59]:
df=pd.DataFrame(d)

In [60]:
df

     comp  name sales
0  google   jay   200
1     mcf  abhi   100
2     mcf   don    12
3  google  dave    11
4      fb  john    55

In [75]:
a=df.groupby("comp")

In [76]:
a

In [77]:
a.sum()

           name  sales
comp
fb         john     55
google  jaydave  20011
mcf     abhidon  10012

In [78]:
a.mean()

C:\Users\JAYESH RAJ\AppData\Local\Temp\ipykernel_30032\1798845826.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  a.mean()

          sales
comp
fb         55.0
google  10005.5
mcf      5006.0

In [79]:
a.describe()

        name                   sales
       count unique   top freq count unique  top freq
comp
fb         1      1  john    1     1      1   55    1
google     2      2   jay    1     2      2  200    1
mcf        2      2  abhi    1     2      2  100    1

In [71]:
a.describe()

AttributeError: 'numpy.ndarray' object has no attribute 'describe'

In [86]:
d1=pd.DataFrame({"a":["1","2","3"],"b":["4","5","6"],"c":["7","8","9"]},index=[1,2,3])

In [87]:
d2=pd.DataFrame({"a":["10","20","30"],"b":["40","50","60"],"c":["70","80","90"]},index=[4,5,6])

In [88]:
d3=pd.DataFrame({"a":["100","200","300"],"b":["400","500","600"],"c":["700","800","900"]},index=[7,8,9])

In [90]:
d2

    a   b   c
4  10  40  70
5  20  50  80
6  30  60  90

In [92]:
pd.concat([d1,d2,d3])

     a    b    c
1    1    4    7
2    2    5    8
3    3    6    9
4   10   40   70
5   20   50   80
6   30   60   90
7  100  400  700
8  200  500  800
9  300  600  900

In [94]:
b=pd.concat([d1,d2,d3],axis=1)

In [96]:
b.fillna(value="no")

    a   b   c   a   b   c    a    b    c
1   1   4   7  no  no  no   no   no   no
2   2   5   8  no  no  no   no   no   no
3   3   6   9  no  no  no   no   no   no
4  no  no  no  10  40  70   no   no   no
5  no  no  no  20  50  80   no   no   no
6  no  no  no  30  60  90   no   no   no
7  no  no  no  no  no  no  100  400  700
8  no  no  no  no  no  no  200  500  800
9  no  no  no  no  no  no  300  600  900

In [99]:
b

     a    b    c    a    b    c    a    b    c
1    1    4    7  NaN  NaN  NaN  NaN  NaN  NaN
2    2    5    8  NaN  NaN  NaN  NaN  NaN  NaN
3    3    6    9  NaN  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN   10   40   70  NaN  NaN  NaN
5  NaN  NaN  NaN   20   50   80  NaN  NaN  NaN
6  NaN  NaN  NaN   30   60   90  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN  NaN  NaN  100  400  700
8  NaN  NaN  NaN  NaN  NaN  NaN  200  500  800
9  NaN  NaN  NaN  NaN  NaN  NaN  300  600  900

In [107]:
pd.merge(d1,d2,on=["c","c"])

Empty DataFrame
Columns: [a_x, b_x, c, a_y, b_y]
Index: []

In [108]:
d1

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [109]:
d2

    a   b   c
4  10  40  70
5  20  50  80
6  30  60  90

In [111]:
pd.merge(d1,d2,on=["c","a"])

Empty DataFrame
Columns: [a, b_x, c, b_y]
Index: []

In [114]:
df1=pd.DataFrame({"a":["1","2","3"],"key":["a","s","d"]})

In [115]:
df2=pd.DataFrame({"b":["10","20","30"],"key":["a","s","d"]})

In [116]:
pd.merge(df1,df2,how="",on="key")

   a key   b
0  1   a  10
1  2   s  20
2  3   d  30

In [119]:
#operations in df

In [121]:
df=pd.DataFrame({"col1":["12","32","22"],"col2":["33","21","21"]})

In [122]:
df

  col1 col2
0   12   33
1   32   21
2   22   21

In [123]:
df.set_index("col1")

     col2
col1
12     33
32     21
22     21

In [124]:
df

  col1 col2
0   12   33
1   32   21
2   22   21

In [126]:
df["col1"].unique()

array(['12', '32', '22'], dtype=object)

In [127]:
df["col2"].unique()

array(['33', '21'], dtype=object)

In [132]:
a=df['col1']

In [135]:
np.array(a)

array(['12', '32', '22'], dtype=object)

In [136]:
s=lambda x:x*2

In [137]:
s(2)

4

In [138]:
pwd

'A:\\udemy'

In [139]:
pd.read_csv("without nan daily.csv")

,T2M_MAX,RH2M,PRECTOTCORR,GWETTOP,GWETROOT,GWETPROF,spi1,spi3,spi6,spi12
0,27.26,77.88,0.04,0.70,0.68,0.66,-0.572472,-0.734306,-0.974808,-0.534983
1,28.15,84.19,5.51,0.70,0.67,0.66,0.716620,0.030154,-0.380847,-0.502788
2,27.99,83.25,1.57,0.70,0.67,0.66,0.184808,0.155388,-0.283118,-0.546615
3,28.31,81.50,0.00,0.68,0.66,0.65,-0.810724,0.150183,-0.287305,-0.718605
4,28.37,78.44,0.00,0.66,0.66,0.65,-0.821934,-0.319664,-0.306209,-0.736941
...,...,...,...,...,...,...,...,...,...,...
14957,27.38,83.38,0.00,0.84,0.84,0.80,-0.813517,-1.042148,-1.282246,-1.445071
14958,27.44,81.81,0.00,0.83,0.83,0.80,-0.805158,-1.042148,-1.278144,-1.486253
14959,27.76,82.06,0.00,0.82,0.82,0.79,-0.836094,-1.059590,-1.287288,-1.605674
14960,28.52,83.44,0.57,0.81,0.81,0.78,-0.079412,-0.487594,-0.810724,-1.179385
14961,28.80,86.56,1.82,0.81,0.80,0.77,0.192986,-0.227894,-0.544966,-0.965156

In [153]:
d=pd.read_html("https://www.keralalotteries.net/")

In [156]:
df

,0,1
0,View Latest August-September Kerala Lottery D...,View Latest August-September Kerala Lottery D...
1,Dated,Name of Lottery & Draw No.
2,19-09-2022,Win Win W-685 Official Result
3,18-09-2022,Thiruvonam Bumper BR 87 Official Result
4,17-09-2022,Karunya KR 567 Official Result
5,16-09-2022,Nirmal NR 294 Official Result
6,15-09-2022,Karunya Plus KN 437 Official Result
7,14-09-2022,Akshaya AK 566 Official Result
8,13-09-2022,Sthree Sakthi SS 330 Official Result
9,12-09-2022,Win Win W-684 Official Result
10,11-09-2022,Fifty Fifty FF 16 Official Result
11,10-09-2022,Karunya KR 566 Official Result
12,09-09-2022,Nirmal NR 293 Official Result
13,07-09-2022,Akshaya AK 565 Official Result
14,06-09-2022,Sthree Sakthi SS 329 Official Result
15,05-09-2022,Win Win W-683 Official Result
16,04-09-2022,Fifty Fifty FF 15 Official Result
17,03-09-2022,Karunya KR 565 Official Result
18,02-09-2022,Nirmal NR 292 Official Result
19,01-09-2022,Karunya Plus KN 436 Official Result
20,31-08-2022,Akshaya AK 564 Official Result
21,30-08-2022,Sthree Sakthi SS 328 Official Result
22,29-08-2022,Win Win W-682 Official Result
23,28-09-2022,Fifty Fifty FF 14 Official Result
24,27-08-2022,Karunya KR 564 Official Result
25,26-08-2022,Nirmal NR 291 Official Result
26,25-08-2022,Karunya Plus KN 435 Official Result
27,24-08-2022,Akshaya AK 563 Official Result
28,23-08-2022,Sthree Sakthi SS 327 Official Result
29,22-08-2022,Win Win W-681 Official Result
30,21-08-2022,Fifty Fifty FF 13 Official Result
31,20-08-2022,Karunya KR 563 Official Result
32,19-08-2022,Nirmal NR 290 Official Result

In [160]:
df.to_csv("lottery.csv")

In [161]:
pwd

'A:\\udemy'